[
  {
    "id": "6f8d74a4-c349-4b79-a8a2-4eabfbf4c58f",
    "title": "Gitlab webhook failed to connect",
    "text": "Hi,\n\nIs anyone else experiencing issues connecting GitLab?\n\nI’ve enabled the integration, added my personal access token, and created a webhook for my group (which includes multiple repositories). I’ve set all the required permissions, added the secret and URL, but I keep encountering the following error in GitLab:\n\nWebhook failed to connect  \n\"The webhook failed to connect and is disabled. To re-enable it, check the Recent events for error details, then test your settings below.\"\n\nI’ve retried multiple times without success. Does anyone know what might be causing this or how to resolve it?",
    "authorName": "CowHoliday",
    "source": "reddit",
    "sourceCreatedAt": "2025-01-04T19:27:10.000Z",
    "sourceUrl": "https://www.reddit.com/r/Linear/comments/1htm5bb/gitlab_webhook_failed_to_connect/",
    "sourceId": "1htm5bb",
    "category": "bug",
    "insight": "GitLab webhook integration not functioning correctly, potential authentication or connection issues with GitLab integration",
    "priority": "high"
  },
  {
    "id": "bf38f220-9b22-45f8-b6b3-9dbe744f2ca8",
    "title": "Tasks for today?",
    "text": "I'm coming from Todoist, so Linear seems very natural to me, however, I miss one thing and cannot find a way to set it up. So, in Todoist, I can mark task due \"Today\", \"Tomorrow\" or any specific date.\n\nIn Linear, I see I can also set due date, but I cannot make a custom view that shows tasks for Due date = Today. I can enter specific day, and predefined options \"One week from now\" are not exactly the same.\n\nTL;DR: I want to see tasks due for only today",
    "authorName": "mark_tyler",
    "source": "reddit",
    "sourceCreatedAt": "2025-01-03T15:13:40.000Z",
    "sourceUrl": "https://www.reddit.com/r/Linear/comments/1hsonb1/tasks_for_today/",
    "sourceId": "1hsonb1",
    "category": "request",
    "insight": "Add quick date selection for tasks (Today, Tomorrow, Specific Date)",
    "priority": "high"
  },
  {
    "id": "3e08e7d5-1a8b-4048-ab58-c6fc2f0a947e",
    "title": "Linear &lt;-&gt; Asana sync?",
    "text": "We are a software development agency and use Linear internally throughout our organization. We have a client who uses Asana and wants us to keep their Asana project up to date with the information that's in our Linear. That will require us to manage two systems, and the client is not willing to pay for extra management time.\n\nBefore we tell them we cannot use Asana, I wanted to see if there might be a way to sync Asana and Linear, with Linear being the \"master\" system to override any conflicts that might occur.\n\nZaiper or [Relay.app](http://Relay.app) might work. Has anyone used either of these? Any other options?",
    "authorName": "sixpsllc",
    "source": "reddit",
    "sourceCreatedAt": "2025-01-01T16:56:36.000Z",
    "sourceUrl": "https://www.reddit.com/r/Linear/comments/1hr6wde/linear_asana_sync/",
    "sourceId": "1hr6wde",
    "category": "question"
  },
  {
    "id": "86421eaf-26b3-4929-afcb-5f5c993ccecc",
    "title": "I made a linux port of Linear for the community!",
    "text": "Hey i've just tried Linear yesterday (on my mac) and i loved it! But i like to transfer my productivity across multiple devices. And i wanted it on my linux machine as well. Sadly Linear didn't come with a linux version of it. And they mentioned on a tweet they don't plan to.\n\nBut i made a very simple electron app that just runs the website.  \nHere is the Repo: [https://github.com/kleo-dev/linear-linux](https://github.com/kleo-dev/linear-linux)",
    "authorName": "KlestiSelimaj",
    "source": "reddit",
    "sourceCreatedAt": "2024-12-30T10:43:28.000Z",
    "sourceUrl": "https://www.reddit.com/r/Linear/comments/1hpkmxh/i_made_a_linux_port_of_linear_for_the_community/",
    "sourceId": "1hpkmxh",
    "category": "other"
  },
  {
    "id": "1bfd4920-d2bf-44a0-be4d-10bcf8846743",
    "title": "Email verification not sending (to my icloud email)",
    "text": "currently i'm using gmail but i want to switch to my icloud email, i need to verify it, i'm checking my inbox, nothing",
    "authorName": "KlestiSelimaj",
    "source": "reddit",
    "sourceCreatedAt": "2024-12-29T20:52:25.000Z",
    "sourceUrl": "https://www.reddit.com/r/Linear/comments/1hp5it9/email_verification_not_sending_to_my_icloud_email/",
    "sourceId": "1hp5it9",
    "category": "bug",
    "insight": "Email verification emails not being delivered to iCloud email addresses",
    "priority": "high"
  },
  {
    "id": "9dfe6e50-d21a-48f9-9294-a5bb142c3eff",
    "title": "Anyone using Linear for a development agency?",
    "text": "Our company is using ClickUp right now for managing everything (tasks, docs, wiki, etc.). But as many of you might know, it can often feel laggy, slow, and… well, frustrating to use at times. So, we’re looking for something better.\n\nI’ve been checking out Linear for a while. I really like how it looks, their changelog is quite active, and I’ve heard a lot of good things about it—especially from SaaS companies. It seems really impressive!\n\nBut here’s the thing: we’re a web and mobile development studio. We work with a lot of different customers and run many projects every year. I’m not sure how well Linear works for a service company like ours, and I was hoping to get some advice.\n\n- Has anyone here used Linear for managing client projects?\n- How do you organize it for multiple clients and tasks?\n- Are you happy with it for this kind of work?\n\nI’d love to hear your thoughts, especially if you’ve faced similar challenges and found ways to make it work. \n\nThanks so much! And Merry Christmas 🎄 ",
    "authorName": "vrybakk",
    "source": "reddit",
    "sourceCreatedAt": "2024-12-26T08:50:23.000Z",
    "sourceUrl": "https://www.reddit.com/r/Linear/comments/1hmkhfn/anyone_using_linear_for_a_development_agency/",
    "sourceId": "1hmkhfn",
    "category": "question"
  },
  {
    "id": "28b3f2a1-23cb-488a-9c63-74c903248db7",
    "title": "Can I hide specific members from cycles?",
    "text": "We have some contractors using Linear, but they aren't participating in the \"cycles\" and aren't in the meetings where we do sprint planning. How can I hide them from the Cycles so that we can see a more accurate cycle completion percentage?",
    "authorName": "CultureExpensive4245",
    "source": "reddit",
    "sourceCreatedAt": "2024-12-19T04:23:57.000Z",
    "sourceUrl": "https://www.reddit.com/r/Linear/comments/1hhkpcw/can_i_hide_specific_members_from_cycles/",
    "sourceId": "1hhkpcw",
    "category": "question"
  },
  {
    "id": "fb9bd5e7-5e2b-4b24-86c9-4973e8b30c71",
    "title": "Anyone built a (g)mail integration yet?",
    "text": "thinking very simple feature\n\n- Button to \"create task from email\" which pops up team selector &amp; then sends to linear\n- also adds link to email so user can click back directly into thread from linear",
    "authorName": "dutchfire-cadu",
    "source": "reddit",
    "sourceCreatedAt": "2024-12-18T16:47:15.000Z",
    "sourceUrl": "https://www.reddit.com/r/Linear/comments/1hh5rio/anyone_built_a_gmail_integration_yet/",
    "sourceId": "1hh5rio",
    "category": "request",
    "insight": "Gmail integration with task creation and email thread linking",
    "priority": "high"
  },
  {
    "id": "b232db3b-d298-4d9c-b7f1-9224c90467e3",
    "title": "How to plan cooldowns?",
    "text": "Our team works in three-week cycles, followed by a one-week cooldown period. During this cooldown, we typically focus on lower-priority tasks, experimentation, or cleanup activities that didn’t quite fit into the main cycle. It’s a critical part of our workflow, giving us space to recharge, address lingering issues, and explore ideas that wouldn’t otherwise make the cut.\n\nHowever, we’ve run into a frustrating limitation: it doesn’t seem possible to assign issues specifically to a cooldown. This makes tracking and planning for these periods much harder than it needs to be, and honestly, makes the feature unusable for us. Ideally, we’d love a feature that allows us to tag or assign tasks directly to cooldowns, similar to how we handle cycles.\n\nAs a workaround, we’ve resorted to using four-week cycles and adding a “cooldown” label to tasks we want to tackle during that week. While this technically gets the job done, it makes our planning process more cumbersome and less intuitive.\n\nDoes anyone else work in a similar cadence? How do you manage planning for cooldowns or off-cycle work? I’d love to hear your thoughts or suggestions!",
    "authorName": "sineandsaw",
    "source": "reddit",
    "sourceCreatedAt": "2024-12-18T15:18:09.000Z",
    "sourceUrl": "https://www.reddit.com/r/Linear/comments/1hh3s41/how_to_plan_cooldowns/",
    "sourceId": "1hh3s41",
    "category": "question"
  },
  {
    "id": "d6fd94c0-dc7b-4440-9445-b77e4847bad0",
    "title": "Any thoughts on creating the typing interface to be more like Notion?",
    "text": "My team and I use Linear pretty religiously but there are a few things that we think would make our experience better.\n\nFor example, I've noticed that the arrows don't always render properly. Sometimes typing `-&gt;` will render to a right arrow nicely, but other times it doesn't.\n\nAnother thing is that I've noticed that we're unable to create bullet lists within to-do lists. We often right explanations or comments about to-do list points as bullet lists.\n\nIs there any more demand for this kind of thing?",
    "authorName": "Seankala",
    "source": "reddit",
    "sourceCreatedAt": "2024-12-18T07:01:00.000Z",
    "sourceUrl": "https://www.reddit.com/r/Linear/comments/1hgw4cf/any_thoughts_on_creating_the_typing_interface_to/",
    "sourceId": "1hgw4cf",
    "category": "request",
    "insight": "Improve text editor rendering, specifically focusing on arrow display and text editing experience similar to Notion",
    "priority": "normal"
  },
  {
    "id": "f62f0614-02a8-4204-849f-0b997aa7333c",
    "title": "Sort groups in list display",
    "text": "Haven't found this anywhere, and wanted to confirm that it's not possible to customize the order in which groups appear in the list display. Thanks!",
    "authorName": "NoTransportation6987",
    "source": "reddit",
    "sourceCreatedAt": "2024-11-27T06:47:34.000Z",
    "sourceUrl": "https://www.reddit.com/r/Linear/comments/1h0ybab/sort_groups_in_list_display/",
    "sourceId": "1h0ybab",
    "category": "question"
  },
  {
    "id": "6c1de3b9-f3ec-4b63-9f70-6bb111918aa2",
    "title": "Linear issues automatically created after meetings",
    "text": "Hey Linear community! 👋\n\nMy name is Mike, PMM at Tactiq. We just released our new Linear integration for Workflows.\n\nYou know that feeling after a meeting when you need to summarize everything, create task briefs, and manually enter issues into Linear?\n\nDon’t get me wrong, creating issues in Linear isn’t the issue, it’s a great experience. But defining priorities, creating project updates, and assigning the tasks for each team in your workspace can be a productivity killer, no matter the platform.\n\nImagine ending a call and instantly having all the Linear issues created and structured with clearly defined briefs, objectives, and deadlines.\n\nThat’s the Linear integration for Tactiq Workflows does:\n\n • Extracts tasks for Linear issues from meeting transcripts.\n • Formats issues for Linear based on team &amp; individual structure needs.\n • Creates issues in Linear for each team you select.\n\nNow you can simply end the meeting, run the Linear workflow and jump straight into prioritizing, assigning, and organizing your issues based on team members and cycles.\n\nStop getting bogged down in busywork and tasks, move faster with clarity.\n\nLet me know what you think!",
    "authorName": "Mike-Savoff",
    "source": "reddit",
    "sourceCreatedAt": "2024-11-22T14:11:05.000Z",
    "sourceUrl": "https://tactiq.io/workflows-integrations/linear",
    "sourceId": "1gx8p9k",
    "category": "other"
  },
  {
    "id": "7fbb69bf-ecb4-48da-a433-18affef1564d",
    "title": "Looking for Advice: Linear.app and GitHub Integration for Multi-Repo Projects",
    "text": "Hi everyone,\n\nI’m exploring [Linear.app](http://Linear.app) for managing my software development company’s workflow. We have a GitHub organization, and our client projects are typically split into separate front-end and back-end repositories.\n\nWhen testing Linear’s GitHub integration, I noticed it links issues to only one repository. However, I usually create separate milestones for the front-end and back-end work. Ideally, I’d like the front-end milestone to link to its corresponding repo and the back-end milestone to its own repo.\n\nIs there a way to achieve this setup in Linear, or would you recommend a better approach? We usually juggle at least five active projects at any given time, so scalability and clarity are important.\n\nAppreciate any insights or tips!",
    "authorName": "0xSSS",
    "source": "reddit",
    "sourceCreatedAt": "2024-11-20T15:13:05.000Z",
    "sourceUrl": "https://www.reddit.com/r/Linear/comments/1gvrpeu/looking_for_advice_linearapp_and_github/",
    "sourceId": "1gvrpeu",
    "category": "question"
  },
  {
    "id": "8d9340ae-3899-47e2-aa74-9f3434bfb70c",
    "title": "Interview engineering manager ",
    "text": "https://youtu.be/AI_UMnTM4o8?si=HA2QZDRO56z4tNly",
    "authorName": "AstronomerFar1202",
    "source": "reddit",
    "sourceCreatedAt": "2024-11-20T14:14:37.000Z",
    "sourceUrl": "https://www.reddit.com/r/Linear/comments/1gvqfme/interview_engineering_manager/",
    "sourceId": "1gvqfme",
    "category": "other"
  },
  {
    "id": "c7851b8e-46fb-49d0-b591-e37798f95df6",
    "title": "Dock notifications label not showing number count.",
    "text": "Am I missing a setting or something? But whenever I have new issues in my inbox I get just a dot on the notification label. Is there a setting somewhere to get it to show an issue count?\n\nhttps://preview.redd.it/v449igffk02e1.png?width=274&amp;format=png&amp;auto=webp&amp;s=e03918e2d860a5325914b61184c94d9b1a745fb2\n\n",
    "authorName": "stupabartlo",
    "source": "reddit",
    "sourceCreatedAt": "2024-11-20T08:04:48.000Z",
    "sourceUrl": "https://www.reddit.com/r/Linear/comments/1gvknfi/dock_notifications_label_not_showing_number_count/",
    "sourceId": "1gvknfi",
    "category": "bug",
    "insight": "Dock notifications lack issue count visibility, only showing generic dot indicator",
    "priority": "normal"
  },
  {
    "id": "9bca8904-9756-4128-a6ab-9c1a7080cb27",
    "title": "Auto response when a ISsue is created via Email",
    "text": "Is there a way to have an autoresponse when an issue is created via email ? \n\nI would like to use Linear as a \"ticketing\" simple tool. that allows me to provide an email to my clients and when they have an Issue send it and receive an email with the Issue ID.  ",
    "authorName": "rdperezch",
    "source": "reddit",
    "sourceCreatedAt": "2024-11-19T21:36:17.000Z",
    "sourceUrl": "https://www.reddit.com/r/Linear/comments/1gv8ooc/auto_response_when_a_issue_is_created_via_email/",
    "sourceId": "1gv8ooc",
    "category": "question"
  },
  {
    "id": "ccb2c3ed-f4b5-451f-9853-440421177d28",
    "title": "Anyone created an internal forum with linear for decision-making?",
    "text": "Hi everyone,\n\nwe’re a small tech startup with 8 people, and we’re struggling to keep track of decisions and discussions across slack and notion. Things feel scattered, and we’re looking for a better way to centralize everything.\n\nour idea is to create an internal forum, kind of like reddit or github discussions, but directly inside linear.   \nWe already use linear for task management, and it’s been great, so having everything in one place would be ideal.\n\nHas anyone here tried to do something like this with linear? any tips, tools, or ideas to make it work? open to hearing any suggestions or insights.\n\nthanks for reading! happy to share what we figure out if we make progress on this.",
    "authorName": "JGoillot",
    "source": "reddit",
    "sourceCreatedAt": "2024-11-19T21:13:45.000Z",
    "sourceUrl": "https://www.reddit.com/r/Linear/comments/1gv8535/anyone_created_an_internal_forum_with_linear_for/",
    "sourceId": "1gv8535",
    "category": "question"
  },
  {
    "id": "0bb603eb-30ed-40bf-bb08-660edd927bd4",
    "title": "Default Board Views",
    "text": "New to using linear and was wondering if you can define additional default views?\n\nFor our projects we like to always have a overall board view for the issues. \n\nI was just wondering if there is a way to set default views for projects so we don't have to make a view every time we make a project?",
    "authorName": "LeviBensley",
    "source": "reddit",
    "sourceCreatedAt": "2024-11-18T10:02:03.000Z",
    "sourceUrl": "https://www.reddit.com/r/Linear/comments/1gu1fak/default_board_views/",
    "sourceId": "1gu1fak",
    "category": "question"
  },
  {
    "id": "31947a8e-4d96-4492-9ba0-9abf6d96beb0",
    "title": "I Recommendations for a project brief template",
    "text": "I want to create a template for a product brief, that we can use as a base document. Therefore I’m looking for best practice examples and suggestions. \nClaude.ai came up with this version, but there might be better solutions. What’s your experience?\n\n# [Feature Name] - Project Brief\n\n## 1. Overview\n- **Feature Summary**: Brief description of the feature and its purpose\n- **Business Value**: Clear statement of business benefits and expected impact\n- **Success Metrics**: Quantifiable measures to evaluate success\n- **Target Users**: Primary user segments affected\n- **Strategic Alignment**: How this feature aligns with broader product/company goals\n\n## 2. Scope &amp; Requirements\n### 2.1 Functional Requirements\n- Core functionality\n- User interactions\n- System behaviors\n- Integration points\n\n### 2.2 Non-Functional Requirements\n- Performance expectations\n- Security requirements\n- Scalability needs\n- Accessibility standards\n- Browser/device support\n\n### 2.3 Out of Scope\n- Explicit listing of what is not included\n- Deferred functionality for future phases\n\n## 3. Deliverables &amp; Results\n### 3.1 Technical Deliverables\n- Code changes\n- API endpoints\n- Database modifications\n- Infrastructure updates\n\n### 3.2 User-Facing Deliverables\n- UI components\n- Documentation\n- Training materials\n- Release notes\n\n### 3.3 Quality Criteria\n- Acceptance criteria\n- Testing requirements\n- Performance benchmarks\n\n## 4. Timeline &amp; Milestones\n- Project phases\n- Key deadlines\n- Dependencies\n- Review points\n- Release schedule\n\n## 5. Key Decisions\n### 5.1 Technical Decisions\n- Architecture choices\n- Technology stack decisions\n- Design patterns\n- Third-party services\n\n### 5.2 Product Decisions\n- UX/UI decisions\n- Feature trade-offs\n- Scope compromises\n\n## 6. Prioritization Guidelines\n- Must-have features\n- Nice-to-have features\n- Priority criteria\n- Dependencies impact\n\n## 7. Resources &amp; Team\n### 7.1 Team Structure\n- Roles and responsibilities\n- Key stakeholders\n- Required specialists\n\n### 7.2 Required Resources\n- Development resources\n- Infrastructure needs\n- External dependencies\n- Budget allocation\n\n## 8. Risks &amp; Mitigation\n- Technical risks\n- Resource risks\n- Timeline risks\n- Mitigation strategies\n- Contingency plans\n\n## 9. Success Criteria &amp; Evaluation\n- KPIs\n- Performance metrics\n- User feedback mechanisms\n- Monitoring plan\n\n## 10. Communication Plan\n- Stakeholder updates\n- Review meetings\n- Documentation requirements\n- Escalation paths\n\n## 11. Dependencies\n### 11.1 Internal Dependencies\n- Other teams\n- Systems\n- Features\n\n### 11.2 External Dependencies\n- Third-party services\n- Partner integrations\n- Legal/compliance requirements\n\n## 12. Post-Launch\n- Monitoring plan\n- Maintenance requirements\n- Support handover\n- Documentation updates\n- Performance review schedule\n\n---\nLast Updated: [Date]\nVersion: [Number]\nOwner: [Name/Role]\n",
    "authorName": "headset38",
    "source": "reddit",
    "sourceCreatedAt": "2024-11-15T07:58:18.000Z",
    "sourceUrl": "https://www.reddit.com/r/Linear/comments/1grrgj4/i_recommendations_for_a_project_brief_template/",
    "sourceId": "1grrgj4",
    "category": "other"
  },
  {
    "id": "0fad6440-07fb-4516-b4e4-fbc510f0dd4a",
    "title": "Linear project setup with multiple products",
    "text": "I was wondering how Linear is supposed to be used when having multiple products to manage.\n\nSuppose the organization \"Acme\" has multiple products (App, 1, App 2, App 3), does each app represent a team? Or would it be better to add more specific teams such as \"Engineering\", \"Design\", ... and adding the apps as projects to those teams who need it? I suppose another option would be to create a workspace for each app, but that seems like a bad approach.\n\n  \nI've been trying to figure this out for a while but it doesn't seem to be documented anywhere. Does anyone have any experience regarding this? All recommendations are more than welcome",
    "authorName": "MrPossible1",
    "source": "reddit",
    "sourceCreatedAt": "2024-11-14T19:18:39.000Z",
    "sourceUrl": "https://www.reddit.com/r/Linear/comments/1grcrjg/linear_project_setup_with_multiple_products/",
    "sourceId": "1grcrjg",
    "category": "question"
  },
  {
    "id": "ca91308d-c4cb-4aae-8fef-fc2a8c472df8",
    "title": "💊 Reports on Steroids part 4: Show date range menu in reports, new templates and dark mode",
    "text": "[Report in dark mode](https://preview.redd.it/1c62wzez3pwd1.png?width=1289&amp;format=png&amp;auto=webp&amp;s=37b77a0e5929d61e1aef3751147478d47e3839f6)\n\n  \nWe've made some improvements to our [Linear add-on](https://screenful.com/linear). You can now choose to display a date range menu when you place a chart in a report. We have also added some new chart and report templates, and a dark mode! You can learn more from the [release notes](https://screenful.com/product-news/reports-on-steroids-part-4-show-date-range-menu-in-reports-new-templates-and-dark-mode).",
    "authorName": "slinna1",
    "source": "reddit",
    "sourceCreatedAt": "2024-10-24T12:03:30.000Z",
    "sourceUrl": "https://www.reddit.com/r/Linear/comments/1gb0zfw/reports_on_steroids_part_4_show_date_range_menu/",
    "sourceId": "1gb0zfw",
    "category": "request",
    "insight": "New report features requested, including dark mode support and date range selector",
    "priority": "normal"
  },
  {
    "id": "3f56860f-82ef-476c-a247-44943e0c04ab",
    "title": "Should Project views live in Projects or Views?",
    "text": "I want to create a view of all of my team's projects. I can create the same view within the team's Views section, or as a new top-tab in the team's Projects section. It looks like it's not possible to move a view between those sections. \n\nI have the same dilemma within the workspace Project views - should I put my view containing my roadmap of projects inside the workspace's Projects view as a new tab at the top, or as a custom view in the workspace's Views tab? \n\n  \nAt this point I can create the same view of projects in 4 places, and I'm not sure what is best. I want to keep information as consolidated and easy to access as possible. I think it makes sense to see the list of projects inside the Projects tab, but then you lose the ability to move it between the workspace or team-specific level. Any recommendations?",
    "authorName": "pqseags",
    "source": "reddit",
    "sourceCreatedAt": "2024-10-17T21:15:43.000Z",
    "sourceUrl": "https://www.reddit.com/r/Linear/comments/1g61nr6/should_project_views_live_in_projects_or_views/",
    "sourceId": "1g61nr6",
    "category": "question"
  },
  {
    "id": "0cbf8a74-d7b0-471b-8fe9-3f57fb7b20f1",
    "title": "We’re excited to launch EchoDrift: A Toolkit to Supercharge Your Linear Workflow",
    "text": "As passionate users of Linear, we’ve always admired its simplicity and efficiency. But after a while, we found ourselves wishing for just a little bit more—automations and tools to handle repetitive tasks and streamline our day-to-day work. **That’s why we created EchoDrift!**\n\n\n\nEchoDrift is a toolkit built on top of Linear that adds features like recurring issues, auto-assignments, and more. These are designed to enhance your workflow without disrupting what makes Linear so great.\n\n\n\nWe’re excited to announce that EchoDrift is now in beta, and you can try it for free during this period!\n\n\n\n🔗 Want to know why we’re building EchoDrift? Check out our story here: [Why we’re building EchoDrift](https://echodrift.app/blog/why-were-building-echodrift)\n\n🔗 Curious about the beta and how to join? Learn more here: [EchoDrift Beta is Here: Try It Now for Free!](https://echodrift.app/blog/echodrift-beta-is-here-try-it-now-for-free)\n\n\n\nWe’d love for you to **give it a try and share your feedback** as we work to make EchoDrift an essential part of your Linear experience.\n\n\n\nFor more information, visit: [https://echodrift.app](https://echodrift.app)",
    "authorName": "mariomka",
    "source": "reddit",
    "sourceCreatedAt": "2024-10-16T09:55:52.000Z",
    "sourceUrl": "https://www.reddit.com/r/Linear/comments/1g4voh9/were_excited_to_launch_echodrift_a_toolkit_to/",
    "sourceId": "1g4voh9",
    "category": "other"
  },
  {
    "id": "6a82b1fd-60d8-4219-ae19-2651dc299261",
    "title": "Possible to share Linear project with clients? ",
    "text": "I'm considering using Linear for my software development agency. It seems great but I still had one questions: **is easy to share individual projects with clients? How do I do this?**\n\nMy clients are not always equally technically savvy, ideally they just get a link, maybe sign in with Gmail and then see a board with issues that we're working on. Of course they should only see their **own** board, not boards from other projects.\n\nAny advice is appreciated!",
    "authorName": "TomLouwagie",
    "source": "reddit",
    "sourceCreatedAt": "2024-10-12T08:42:22.000Z",
    "sourceUrl": "https://www.reddit.com/r/Linear/comments/1g1vud0/possible_to_share_linear_project_with_clients/",
    "sourceId": "1g1vud0",
    "category": "question"
  },
  {
    "id": "80ff00b6-4046-4e70-96d2-2ca75792e9e3",
    "title": "Linear changelog | Document subscriptions",
    "text": "",
    "authorName": "gapmunky",
    "source": "reddit",
    "sourceCreatedAt": "2024-10-11T08:28:21.000Z",
    "sourceUrl": "https://www.youtube.com/watch?v=9Mfe1CMB2zA",
    "sourceId": "1g151cj",
    "category": "other"
  },
  {
    "id": "d9a774f1-ec78-48e6-b3a9-814397d1bdfa",
    "title": "Automatically assigning imported issues to a project",
    "text": "Hi.\nMy workspace is connected to two github repos. Issues are synced unidirectionally from github to linear. (If i set bidirectional issue sync, one repo becomes the \"default\" and there is no way to change this)\n\nIs there any way to automatically assign imported issues from a repo to a specific project? \n\nThank you",
    "authorName": "boodleboodle",
    "source": "reddit",
    "sourceCreatedAt": "2024-10-11T03:41:49.000Z",
    "sourceUrl": "https://www.reddit.com/r/Linear/comments/1g10ymu/automatically_assigning_imported_issues_to_a/",
    "sourceId": "1g10ymu",
    "category": "question"
  },
  {
    "id": "b7c68bfa-936e-4a25-bf49-0fcd1c544357",
    "title": "Viewing \"Completed Date\" in Issue Views",
    "text": "[Can only see the created and updated dates on the RHS](https://preview.redd.it/in80xx55emtd1.png?width=2544&amp;format=png&amp;auto=webp&amp;s=92a9c2854589841fee0d20f318ca0dda25029538)\n\nHi, I may be missing something obvious, but is there a way to sort and view the completed date in the issue views? Interestingly, you can \\_filter\\_ by completed date in Views but I cannot find any option to view the completed date, only the 'created' and 'updated' dates, nor can I sort by completed date.\n\n[no option for completed date](https://preview.redd.it/8gauved8emtd1.png?width=608&amp;format=png&amp;auto=webp&amp;s=9d489a41b8590fcd8ddb459fb0e22e5509349abf)\n\nThe newly released \"order completed by recency\" toggle also seems to do nothing for most of my views.\n\nAnyone have tips or similar experiences?",
    "authorName": "swimboy817",
    "source": "reddit",
    "sourceCreatedAt": "2024-10-08T23:52:17.000Z",
    "sourceUrl": "https://www.reddit.com/r/Linear/comments/1fze92p/viewing_completed_date_in_issue_views/",
    "sourceId": "1fze92p",
    "category": "bug",
    "insight": "Missing 'Completed Date' in issue details view",
    "priority": "normal"
  },
  {
    "id": "80bc8589-f478-4322-ad80-d2d1928114d1",
    "title": "Does the Contextual Menu Not Work on Windows",
    "text": "Hello, just started using linear. Was on my MAC and switched over to Windows and noticed that the contextual menu / right-click doesn't work on Windows. Tried on both Chrome and Edge? Am I doing something wrong here is it just one of those quirky windows things?\n\nhttps://preview.redd.it/nna1y00to9td1.png?width=934&amp;format=png&amp;auto=webp&amp;s=0ee9cdb4b03c1e9376749b0c322b91e09a6569c3\n\n",
    "authorName": "ShakespeareDead",
    "source": "reddit",
    "sourceCreatedAt": "2024-10-07T05:07:45.000Z",
    "sourceUrl": "https://www.reddit.com/r/Linear/comments/1fy03c4/does_the_contextual_menu_not_work_on_windows/",
    "sourceId": "1fy03c4",
    "category": "bug",
    "insight": "Contextual menu/right-click functionality not working on Windows browsers",
    "priority": "high"
  },
  {
    "id": "9e7b56d0-4113-4e82-a566-bc3102fb04d1",
    "title": "Document Organization and Notifications",
    "text": "Hey, I use [linear.app](http://linear.app) for my startup. We use it mostly for development and organizing our git branches with whatever we're currently working on.\n\nHOWEVER - I've started using the documents features to do most of our startups related note-taking  and brainstorming since it's so simple (basically just a markdown editor). I'm trying to find a way to:\n\n1) Organize my Linear notes in a way that is more centralized.\n\n2) Be able to notify my cofounder (or other Linear team members) when a new document is created\n\n3) See which documents my cofounder has read/not read\n\n  \nFor now, I am going to create new issues with the label \"documentation\" and assign them to my cofounder with the document attached. \n\nIs there a better way for me to do this/am I doing it wrong? TIA",
    "authorName": "sydalias",
    "source": "reddit",
    "sourceCreatedAt": "2024-10-06T15:37:43.000Z",
    "sourceUrl": "https://www.reddit.com/r/Linear/comments/1fxja4t/document_organization_and_notifications/",
    "sourceId": "1fxja4t",
    "category": "other"
  },
  {
    "id": "2a7b884e-3f16-4968-af20-07859ba023ad",
    "title": "How do you use the backlog?",
    "text": "I come from a branding background. I’ve only ever worked with teams that have little to no project management in place. Or worked by myself in something like Things 3.\n\nI’m trying to get myself (studio working with various freelancers) set up with linear. I want to keep track of everything I have coming through the studio and be able to assign stuff to people where needed.\n\nFor the people with a software dev background. How do you use the backlog? Is it just say, an inbox? For issues and tasks that need to be looked at, but you’ve not yet got round to either queuing them up to start or getting underway?",
    "authorName": "stupabartlo",
    "source": "reddit",
    "sourceCreatedAt": "2024-10-05T13:02:27.000Z",
    "sourceUrl": "https://www.reddit.com/r/Linear/comments/1fwpwk4/how_do_you_use_the_backlog/",
    "sourceId": "1fwpwk4",
    "category": "question"
  },
  {
    "id": "7438b684-2b05-415f-9f7f-2a6a0b26dab7",
    "title": "Any way of connecting Linear to Apple Reminders?",
    "text": "I love Linear for PM, even though I'm in comms. But i'd like a lightweight native task solution, and Reminders is my go-to. Any way to integrate the two?",
    "authorName": "wowbiscuit",
    "source": "reddit",
    "sourceCreatedAt": "2024-09-03T20:58:32.000Z",
    "sourceUrl": "https://www.reddit.com/r/Linear/comments/1f8b52y/any_way_of_connecting_linear_to_apple_reminders/",
    "sourceId": "1f8b52y",
    "category": "request",
    "insight": "Integration between Linear and Apple Reminders for cross-platform task synchronization",
    "priority": "normal"
  },
  {
    "id": "63e60698-911d-4ae0-b72c-816ac346014e",
    "title": "Share issues between projects",
    "text": "Hi, i'd like to add an issue to 2 projects but linear is only allowing an issue to belong to 1 project. \n\nIs there a way to do this?\n\n  \nReason:\n\n* We use 1 project as the main dumping ground for all tasks\n* We use a \"monthly project\" to accomplish tasks we need to do that month\n\nCurrently im using labels, but ideally id like to share an issue between projects.\n\n  \nNote:\n\n* do not want to use cycles\n* do not want to use anything else\n\nJust want to share an issue between 2 projects",
    "authorName": "ashpreetbedi",
    "source": "reddit",
    "sourceCreatedAt": "2024-09-03T11:09:42.000Z",
    "sourceUrl": "https://www.reddit.com/r/Linear/comments/1f7x759/share_issues_between_projects/",
    "sourceId": "1f7x759",
    "category": "question"
  },
  {
    "id": "f68ae4f7-71c2-4626-954b-c86a867e6068",
    "title": "Linear website breaks with ublock.",
    "text": "Hey, I found out about this app recnetly, and seemed nice and wanted to give it a try,\n\nHowever, it seems like ublock blocks something about linear and the website is not able to function\n\nLooked up and seems like its because of [sentry.io](http://sentry.io) API. \n\nI understand Linear's purpose for error tracking and it is up to the company to do so,   \nbut I feel like tracking shouldn't be necessary for the website to function.\n\nHopefully a person from Linear can get this fixed.\n\nhttps://preview.redd.it/wfwdwf0vwamd1.png?width=1434&amp;format=png&amp;auto=webp&amp;s=40143724dbfa38e0a15dde0d4ce7f242c589e617\n\n",
    "authorName": "jerichoi224",
    "source": "reddit",
    "sourceCreatedAt": "2024-09-02T01:52:54.000Z",
    "sourceUrl": "https://www.reddit.com/r/Linear/comments/1f6v6sf/linear_website_breaks_with_ublock/",
    "sourceId": "1f6v6sf",
    "category": "bug",
    "insight": "Website compatibility issue with ad blockers (uBlock)",
    "priority": "high"
  },
  {
    "id": "61a0dc4a-a86a-49bf-9d70-59a6ccf318e0",
    "title": "Using linear to manage project and task for my UI/UX Team",
    "text": "I understand that Linear is build mainly for developer. i find that it is really easy to use and not overwhelming with features like other project management tools. My question :\n\n1.  Does anyone here that working in ui/ux and design using Linear for project and task management\n2. Is this a good tool for my team or any other better option? we are using clickup for now.",
    "authorName": "eaglevis1",
    "source": "reddit",
    "sourceCreatedAt": "2024-08-31T04:47:44.000Z",
    "sourceUrl": "https://www.reddit.com/r/Linear/comments/1f5fbq4/using_linear_to_manage_project_and_task_for_my/",
    "sourceId": "1f5fbq4",
    "category": "other"
  },
  {
    "id": "ed7d75a2-7030-4361-8480-f3d1e4719ff8",
    "title": "Linear Mobile App beta — Sign up here!",
    "text": "",
    "authorName": "gapmunky",
    "source": "reddit",
    "sourceCreatedAt": "2024-08-26T17:22:52.000Z",
    "sourceUrl": "https://linear.app/mobile",
    "sourceId": "1f1ttph",
    "category": "other"
  },
  {
    "id": "15bf07f9-1b21-46e0-8577-d30615ed1b75",
    "title": "Any updates on documentation?",
    "text": "We are currently considering migrating from Jira and are evaluating both Linear and Notion as potential options. While we are impressed with Linear's capabilities, current project-level documentation not fully meet our needs. Could you please share any plans or upcoming updates you have for enhancing the project documentation features in Linear?",
    "authorName": "BDNK1",
    "source": "reddit",
    "sourceCreatedAt": "2024-08-26T08:08:50.000Z",
    "sourceUrl": "https://www.reddit.com/r/Linear/comments/1f1iv7l/any_updates_on_documentation/",
    "sourceId": "1f1iv7l",
    "category": "question"
  },
  {
    "id": "e7d54a66-bd6b-4039-b334-5d4ac1dc5631",
    "title": "I made a web-extension that would link linear issues to the respective GitLab/GitHub branches",
    "text": "I previously used JIRA for project management in the company for the work, I recently switched to Linear app for my side hobby projects , its enjoyable  \nbut I like the part in JIRA where I can click on the issue that would jump me directly into GitLab repo branch for that issue,  \nSomehow, I was unable to replicate that flow in Linear so built an extension that would add a GitLab/GitHub button in the issue page that would direct me to that branch.\n\n[https://github.com/yashwanth2804/Linear-gitlab-extention](https://github.com/yashwanth2804/Linear-gitlab-extention)\n\n\n\nEdit\n\nMade chrome extension \n\n[Linear Lab Linker - Chrome Web Store (google.com)](https://chromewebstore.google.com/detail/linear-lab-linker/jhdjdgjobdpbmdofkcjjnbbpkhlfoppc) , please have a try",
    "authorName": "yashwanth2804",
    "source": "reddit",
    "sourceCreatedAt": "2024-08-25T12:15:27.000Z",
    "sourceUrl": "https://www.reddit.com/r/Linear/comments/1f0uyuu/i_made_a_webextension_that_would_link_linear/",
    "sourceId": "1f0uyuu",
    "category": "other"
  },
  {
    "id": "09478878-47e0-4dc7-95b2-fb44f2a6bbdf",
    "title": "Linear logging out daily",
    "text": "Anyone experiencing this problem? I'd like to persist sessions for a lot longer. Tired of daily entering my email and re-logging.",
    "authorName": "airkiddd",
    "source": "reddit",
    "sourceCreatedAt": "2024-08-23T17:24:00.000Z",
    "sourceUrl": "https://www.reddit.com/r/Linear/comments/1ezihrv/linear_logging_out_daily/",
    "sourceId": "1ezihrv",
    "category": "bug",
    "insight": "Session management issue causing frequent unintended logouts",
    "priority": "high"
  },
  {
    "id": "f1c8a98d-e2c7-43a2-aaa0-c7440b530174",
    "title": "Commits not being linked in issues",
    "text": "I just recently started using Linear. All integrations are properly connected, and PR's even properly show when using issue ID's.\n\nI just sent a hotfix with the issue ID in the comment, but it's nowhere to be found in Linear. Does anyone have an idea about what could be going on?",
    "authorName": "listik",
    "source": "reddit",
    "sourceCreatedAt": "2024-08-20T10:02:21.000Z",
    "sourceUrl": "https://www.reddit.com/r/Linear/comments/1ewrp20/commits_not_being_linked_in_issues/",
    "sourceId": "1ewrp20",
    "category": "bug",
    "insight": "Git commits not being linked to corresponding issues, despite other integrations working correctly",
    "priority": "high"
  },
  {
    "id": "82f9cdc4-63ae-4603-8af1-8aec2f9be9c9",
    "title": "How to manage release versions?",
    "text": "I struggle how to manage my software releases. If I create an initiative for every release, I can only put in projects. \nIf I create a project per release, I cannot assign issues to two projects. \nHow do you manage this? Labels are feeling not that right..",
    "authorName": "freiwaldDev",
    "source": "reddit",
    "sourceCreatedAt": "2024-08-19T19:21:34.000Z",
    "sourceUrl": "https://www.reddit.com/r/Linear/comments/1ewajm0/how_to_manage_release_versions/",
    "sourceId": "1ewajm0",
    "category": "question"
  },
  {
    "id": "1a8921ca-c9ba-4e25-8c5a-aff7ffb4a0c4",
    "title": "Linear for Game Dev",
    "text": "How do you use it (free-to-play)?\n\nCurrently, I have **Teams** as **Game**.\n\nInside I use **Projects** as **Versions**, so that I could have the scope for the next release, dates, views, etc.\n\nIt works well, and it feels that nothing else is needed, but there are also **Milestones** (which make projects more granular, and I don't need it), and now **Initiatives**, which are a higher-level.\n\nBecause now docs can be linked to Initiatives, it sounds like a **Game** should be an **Initiative** and have a set of docs, with Projects kept as Versions. A team would be able to work on more games/initiatives if needed.\n\nWhat do you think would be the best approach?",
    "authorName": "No_Newspaper6902",
    "source": "reddit",
    "sourceCreatedAt": "2024-07-02T22:15:05.000Z",
    "sourceUrl": "https://www.reddit.com/r/Linear/comments/1dtyayf/linear_for_game_dev/",
    "sourceId": "1dtyayf",
    "category": "question"
  },
  {
    "id": "62d71a50-c164-4227-92d0-cc863bcc8592",
    "title": "Got sick of s#!t task descriptions!",
    "text": "Hey all,\n\nI've been a software dev for the last 15 years and finally got sick of the tickets with awful descriptions on them that always seem to squirm through the process.\n\nI decided a few months ago to say no more, up-skilled myself on LLMs and built a little Chrome extension that adds a button to Linear when you edit issues. One press rewrites the description formatting it nicely, separating it into an introduction, user stories, acceptance criteria, assumptions and outstanding questions. (See video for a demo). Built it for myself but figured it may be useful to others!\n\nSignup is free (No credit card) and you'll get 35 free rewrites to try it out. If you don't like it we will take any feedback we can get! If you do like it you can purchase a subscription which is fairly low cost ($5 per month, basically running costs + tax + the payment processor charges).\n\nWe have gone live with it on ProductHunt today and would love any feedback the community has (Upvotes help too :D)!  \n[https://www.producthunt.com/posts/skribr](https://www.producthunt.com/posts/skribr)\n\nhttps://reddit.com/link/1dsxtep/video/f771cgzosx9d1/player",
    "authorName": "therealkawba",
    "source": "reddit",
    "sourceCreatedAt": "2024-07-01T16:49:56.000Z",
    "sourceUrl": "https://www.reddit.com/r/Linear/comments/1dsxtep/got_sick_of_st_task_descriptions/",
    "sourceId": "1dsxtep",
    "category": "other"
  },
  {
    "id": "75cfa6f4-f322-4c4b-9582-7194abb18d49",
    "title": "Tired of poorly written issues? Here's an easy fix",
    "text": "So a friend of mine created a one click solution to badly written issues. It's a web extension you can run and it generates a full breakdown of any ticket that you can use as a great place to get started with the details. BOOM!\n\n[https://www.skribr.com/](https://www.skribr.com/) Have a look! Also works with Trello and JIRA too!\n\n",
    "authorName": "nixeh32",
    "source": "reddit",
    "sourceCreatedAt": "2024-06-27T20:08:29.000Z",
    "sourceUrl": "https://www.reddit.com/r/Linear/comments/1dq0rt8/tired_of_poorly_written_issues_heres_an_easy_fix/",
    "sourceId": "1dq0rt8",
    "category": "other"
  },
  {
    "id": "44b480b3-2358-4908-b886-ec1fac0c7abd",
    "title": "Any plans for team-level docs?",
    "text": "Currently, we have to combine Linear with something like Notion in order to provided good documentation support.\n\nI'm wondering if Linear as product will ever position itself a Knowledge Base management app as well.\n\n  \nSide note: if they ever do decide to implement team-level docs, I hope it is in the form of DataViews (like Obsidian) rather than Database (like Notion)",
    "authorName": "Trk-5000",
    "source": "reddit",
    "sourceCreatedAt": "2024-06-24T09:13:38.000Z",
    "sourceUrl": "https://www.reddit.com/r/Linear/comments/1dn96u2/any_plans_for_teamlevel_docs/",
    "sourceId": "1dn96u2",
    "category": "question"
  },
  {
    "id": "57bea411-dad3-4a59-a76f-f608ead8d7c8",
    "title": "Global quick capture",
    "text": "I’m wondering if there’s a global quick capture / issue creation keyboard shortcut I’m missing \n\nI’m looking for a function akin to what Things or OmniFocus does where as long as the app is running on a Mac you can hit a keyboard shortcut and it pulls up an issue creation window…\n\nAnyone know?",
    "authorName": "No_Detective9698",
    "source": "reddit",
    "sourceCreatedAt": "2024-06-15T14:58:07.000Z",
    "sourceUrl": "https://www.reddit.com/r/Linear/comments/1dgjt7j/global_quick_capture/",
    "sourceId": "1dgjt7j",
    "category": "question"
  },
  {
    "id": "c20db388-044f-497c-8579-8c1e93654858",
    "title": "How to tag or label projects?",
    "text": "How do I apply labels or some kind of grouping mechanism to projects under 1 team. I like to be able to group projects for say Theme 1 (reliability) and Theme 2(performance)?\n\nThanks",
    "authorName": "Purple-Geologist972",
    "source": "reddit",
    "sourceCreatedAt": "2024-06-07T02:49:04.000Z",
    "sourceUrl": "https://www.reddit.com/r/Linear/comments/1da0d6b/how_to_tag_or_label_projects/",
    "sourceId": "1da0d6b",
    "category": "question"
  },
  {
    "id": "df44cae0-d4cb-48c8-b43b-5f45944662b4",
    "title": "Drag and drop issues into schedule",
    "text": "Should I user another tool for this micro-scheduling and use keep in linear the high-level issues?\n\nOr is there a workaround to schedule visually within linear?\n\n(just like you can do with projects on the roadmap)",
    "authorName": "gioknx",
    "source": "reddit",
    "sourceCreatedAt": "2024-06-06T01:49:52.000Z",
    "sourceUrl": "https://www.reddit.com/r/Linear/comments/1d96xav/drag_and_drop_issues_into_schedule/",
    "sourceId": "1d96xav",
    "category": "question"
  },
  {
    "id": "8d66fbe3-8b4a-4a4a-9f27-6a56b7c9bdd5",
    "title": "Linear might be too good ,",
    "text": "Here's my setup how i use linear as a solo developer , share how you guys organise your work with linear.\n\nhttps://preview.redd.it/1g5uxe892t3d1.png?width=1895&amp;format=png&amp;auto=webp&amp;s=2e0155e00a91744f4239b54ddc501318ae6d69e3\n\n",
    "authorName": "BattleEmbarrassed515",
    "source": "reddit",
    "sourceCreatedAt": "2024-05-31T18:27:39.000Z",
    "sourceUrl": "https://www.reddit.com/r/Linear/comments/1d52jfx/linear_might_be_too_good/",
    "sourceId": "1d52jfx",
    "category": "other"
  },
  {
    "id": "f731907c-0d6c-41eb-98f0-fd65cb74821c",
    "title": "Issue Template Improvements -&gt; Creating from Issue and placholder in titles",
    "text": "Right now, the only way to[ create issue templates seems to be from the settings](https://linear.app/docs/issue-templates) (LMK if wrong)\n\n1. As a user, id like to create a template from an issue. somewhere in the setting.   \nAs projects grow, some templates need to be adjusted. I find myself having the templated editor open, then making some changes twice (to a ticket, and then the template so future tickets following this template are adjusted)\n\n2. I placeholders only seem to work in specific fields, but not in the titles (of subtasks for example). \n\nIf I am using a template, chances are the issue titles will be similar. If I need to change the placeholder in each title, I am saving little time managing templates. \n\n\n\n ",
    "authorName": "benhbell",
    "source": "reddit",
    "sourceCreatedAt": "2024-05-28T15:13:52.000Z",
    "sourceUrl": "https://www.reddit.com/r/Linear/comments/1d2lvso/issue_template_improvements_creating_from_issue/",
    "sourceId": "1d2lvso",
    "category": "request",
    "insight": "Expand issue template creation methods, allowing template generation directly from existing issues",
    "priority": "normal"
  },
  {
    "id": "a62b5445-d391-44e2-aa63-05ff94fabdd4",
    "title": "App Integration for client asks",
    "text": "I'm a producer at web design agency that uses Linear. We are wanting a solution for clients to make tasks for us that automatically show up in Linear without them having to download an app. I'm thinking [Marker.io](http://Marker.io) or Zendesk - has anyone else found another integration that worked well for this sort of thing? Main goal is to avoid everything being an email that we then have to input into Linear.",
    "authorName": "Apprehensive-Hat9296",
    "source": "reddit",
    "sourceCreatedAt": "2024-05-09T21:57:05.000Z",
    "sourceUrl": "https://www.reddit.com/r/Linear/comments/1co970d/app_integration_for_client_asks/",
    "sourceId": "1co970d",
    "category": "request",
    "insight": "External client task creation interface without requiring app download",
    "priority": "high"
  },
  {
    "id": "e4ad9fa4-4558-4148-adc4-86111b2b6d10",
    "title": "Is it possible to create this automation...?",
    "text": "My ideia was to automatically create issues from e-mails sent to a specific address, which I did using the email-to-issue functionality. But now I was wondering if I can set some flows to assign this issue created from the email to a specific user ",
    "authorName": "gbritgs",
    "source": "reddit",
    "sourceCreatedAt": "2024-03-13T19:44:11.000Z",
    "sourceUrl": "https://www.reddit.com/r/Linear/comments/1be0r5q/is_it_possible_to_create_this_automation/",
    "sourceId": "1be0r5q",
    "category": "question"
  },
  {
    "id": "faa84b91-aef9-4d4c-99fa-eb525199cbdf",
    "title": "Considering the switch to Linear, but filling a cycle seems like a hassle. Is there a better way ?",
    "text": "Our workflow is pretty sprint oriented, a small software development team planning ahead for 2 weeks by using sprints (or cycles as linear prefers to call them).  \nA few days before a new cycle starts our product manager and scrum master (who is also the lead-dev), sit together and decide which issues shall be taken on during the next upcoming cycle. While testing out this workflow, it seemed like the only way to move backlog items to a cycle was by:  \n\n\n1. Going to backlog\n2. Opening a task\n3. Click ' Add to cycle '\n4. Choose cycle to which it should be added.\n\n&amp;#x200B;\n\nThis requires 4 actions, repeatedly for each task. Moving 30 issues to a cycle would mean 120 clicks. This feels like there should be a much better way to achieve this. I'm used to being able to drag &amp; drop issues from my backlog to my sprint board. (which is effectly 1 slow click instead of 4 seperate clicks).  \n\n\nMy 2nd concern: I need to be in the backlog to edit issues to move them to the cycle. Meaning, I do not have an overview of what is already in the cycle and how filled up it is. If I need to play for 180 story points, I now need to either keep a headcount while filling the cycle up, or I need another browser window to keep getting back to check how much is already in there.  \n\n\nCan anyone inform me if there are better ways that I have not discovered yet to make my life with linear easier. Or should we simply stop looking at linear as an option and move on to something else.  \n",
    "authorName": "ghanghis",
    "source": "reddit",
    "sourceCreatedAt": "2024-03-07T10:16:00.000Z",
    "sourceUrl": "https://www.reddit.com/r/Linear/comments/1b8r79i/considering_the_switch_to_linear_but_filling_a/",
    "sourceId": "1b8r79i",
    "category": "question"
  },
  {
    "id": "2b348fee-d1fd-4e68-816f-9db6464d9597",
    "title": "Adding $ weights to requests?",
    "text": "I'd like to use Linear to create a Product Feature Request functionality for customer-facing roles to capture requests from customers by logging the request and customer name, and adding a weight related to the opportunity/pipeline size for each customer. All sub-feature request will be aggregated by their weight, and feature requests will have a total $$$ assigned to them to allow the product team/engineers to prioritise new features this way.\n\nI know I can use Estimates in Linear but the scales are quite limited (e.g. from 1 to 7, or 7 different t-shirt sizes from S to XXL, etc.). Ideally, I'd like to have any number assinged to each request (e.g. from a few thousands of $ to millions of $).\n\nAnyone know how I could do this?",
    "authorName": "Ok_Lab3180",
    "source": "reddit",
    "sourceCreatedAt": "2024-03-04T10:30:05.000Z",
    "sourceUrl": "https://www.reddit.com/r/Linear/comments/1b67r8c/adding_weights_to_requests/",
    "sourceId": "1b67r8c",
    "category": "request",
    "insight": "Feature request for weighted customer feature requests tracking system",
    "priority": "normal"
  },
  {
    "id": "04361920-b838-46fb-ad48-5a5ef91bd16a",
    "title": "Pricing Linear; I have to pay for all members? Very expensive.",
    "text": "I want to upgrade for me as I'm creating tasks for different devs and I need to upload files. But I have to pay as well for my them just to see the issues? Is there any guest role?\n\nIf I have 3 or 4 workers, then I have to pay like 40$ which I think it's expensive AF  \n\n\nAny alternatives? At least including 5 members? for a moderate price",
    "authorName": "nomarsnop",
    "source": "reddit",
    "sourceCreatedAt": "2024-02-22T12:46:24.000Z",
    "sourceUrl": "https://www.reddit.com/r/Linear/comments/1ax5l2w/pricing_linear_i_have_to_pay_for_all_members_very/",
    "sourceId": "1ax5l2w",
    "category": "question"
  },
  {
    "id": "3363b42d-49cd-4d10-aff3-07825449037a",
    "title": "RSS Changelog URL?",
    "text": " \n\nThe changelog says \"Our changelog and blog now have RSS feeds. Subscribe at the link in the header👆\"\n\nCan someone tell me what the actual link for the RSS feed is? The link itself ([https://linear.app/changelog](https://linear.app/changelog)) does not work for RSS readers.\n\nThank you!",
    "authorName": "Dultus",
    "source": "reddit",
    "sourceCreatedAt": "2024-02-18T22:05:49.000Z",
    "sourceUrl": "https://www.reddit.com/r/Linear/comments/1au6c8o/rss_changelog_url/",
    "sourceId": "1au6c8o",
    "category": "question"
  },
  {
    "id": "48d9d928-03d7-401e-bb65-5a7e4ce7f823",
    "title": "Linear for a Marketing Agency",
    "text": "Linear for a marketing agency-- perhaps a bridge too far?  \n\n\nCOO of a marketing agency. Looking to rid ourselves of basecamp and 4 other SaaS tools used for \"project management.\" Our current processes would disgust too many folks, so I won't share more. I'm planning to implement Agile-ish practices (Mon. - Thurs. cycle/sprint). There's too much \"hey I need a dev to look at this right now.\"\n\nMaking the switch to Linear would be highly practical except for the lack of built-in 'actuals' and forced bucketing of 'estimates.' **Being an opinionated piece of software, I presume there is no current ability or future plan for adding custom fields?**\n\nI am biased to try to use Linear having a dev background and for its simplicity, albeit non-extensible. Linear obviously isn't built with a target market of agencies, but it would be nice to retrofit it accordingly without a 'bandaid' of plugins and third parties. The last thing I want to do is dive into the complexities of ClickUp or database-mess of Notion, so Asana / Monday are the unfortunate likely plan Bs here. ",
    "authorName": "aajaces",
    "source": "reddit",
    "sourceCreatedAt": "2024-02-14T19:44:10.000Z",
    "sourceUrl": "https://www.reddit.com/r/Linear/comments/1aqvulk/linear_for_a_marketing_agency/",
    "sourceId": "1aqvulk",
    "category": "question"
  },
  {
    "id": "bb98ec47-112d-4478-ba32-8b77d492969a",
    "title": "Other languages ?",
    "text": "I tried to look around, but there seems to be no options about language ?\n\nI assume Linear is only available in English then ?",
    "authorName": "GoodHovercraft5602",
    "source": "reddit",
    "sourceCreatedAt": "2024-01-25T04:04:38.000Z",
    "sourceUrl": "https://www.reddit.com/r/Linear/comments/19f0gq7/other_languages/",
    "sourceId": "19f0gq7",
    "category": "question"
  },
  {
    "id": "46804e65-2ee1-4f2e-bda0-09332a01428d",
    "title": "Moving from Clickup to Linear, any others done this?",
    "text": "Hey all,\n\nWe want to move from Clickup to Linear, but linear currently only has a CLI tool to import issues. I've messed about and it seems to work okay, but does anyone have any tips about the changeover who has done it before?",
    "authorName": "itsDitch",
    "source": "reddit",
    "sourceCreatedAt": "2024-01-03T11:04:42.000Z",
    "sourceUrl": "https://www.reddit.com/r/Linear/comments/18xgvda/moving_from_clickup_to_linear_any_others_done_this/",
    "sourceId": "18xgvda",
    "category": "question"
  },
  {
    "id": "41a14053-fbc2-45a6-9626-bd748ece6544",
    "title": "Why issues?",
    "text": "Hi, I'm exploring Linear and I'm curious why you call it \"Issues\"? Wouldn't \"Tasks\" or \"Features\" be more suitable? Issue to me sounds like a bug that needs to be fixed, or like old school ticketing systems from 20 years ago... :)",
    "authorName": "mellow_marshmallow",
    "source": "reddit",
    "sourceCreatedAt": "2023-11-29T16:10:25.000Z",
    "sourceUrl": "https://www.reddit.com/r/Linear/comments/186t1nb/why_issues/",
    "sourceId": "186t1nb",
    "category": "question"
  },
  {
    "id": "6723451d-8ab4-4ad1-ad75-918d22df06de",
    "title": "Say YES pleaaaaassseeeee. It's not a marriage proposal 🤣",
    "text": "This morning, we reached the south of France for one week to ship our first tool. A bit tired but happy about this offsite kickstart. \n\nhttps://preview.redd.it/0jb7xr7fhj1c1.jpg?width=900&amp;format=pjpg&amp;auto=webp&amp;s=fb094af042c700e8e5b136c307e563a7a95e409c\n\nThe first tool of our Product Studio is a Linear plug-in to take project management to the final stage of collaboration between: Tech teams 🤖 Business teams\n\nWhy? Because as Tech Agency, we need it too. *to copy and paste, summary to do, live demo to make, updates on Tech capacity leftover, etc).*\n\nWhy? Because as Tech Agency we need it too. \n\nBelow is our Ask? 👇\n\nIf you're also a Linear fan! \n\nWe're looking for 10 beta testers to present our tool next Friday.\n\nWho would like to discover the tool and give us feedback? ",
    "authorName": "wawa_masked",
    "source": "reddit",
    "sourceCreatedAt": "2023-11-20T18:52:13.000Z",
    "sourceUrl": "https://www.reddit.com/r/Linear/comments/17zvsbu/say_yes_pleaaaaassseeeee_its_not_a_marriage/",
    "sourceId": "17zvsbu",
    "category": "other"
  },
  {
    "id": "b1a1582d-e6a9-43d5-94cc-e1dad2fda4eb",
    "title": "How to add a new status in Linear?",
    "text": "Was looking at Linear but couldn't figure out how to add a new status apart from Todo, In Progress, Complete.\n\nI should be able to add custom status like \"Design done / Dev pending\".\n\n&amp;#x200B;\n\nhttps://preview.redd.it/li9r71ow1f6a1.png?width=4580&amp;format=png&amp;auto=webp&amp;s=f060a29faca9b698a600bc1a5d7bbdb48f2f8c1b\n\n&amp;#x200B;\n\nAnyone figured it out yet?",
    "authorName": "heysankalp",
    "source": "reddit",
    "sourceCreatedAt": "2022-12-17T08:08:37.000Z",
    "sourceUrl": "https://www.reddit.com/r/Linear/comments/zo1jd0/how_to_add_a_new_status_in_linear/",
    "sourceId": "zo1jd0",
    "category": "question"
  },
  {
    "id": "d18cf120-7eef-4aa2-8ac4-d8fa23042453",
    "title": "How To Import and Export in Linear",
    "text": "",
    "authorName": "gapmunky",
    "source": "reddit",
    "sourceCreatedAt": "2022-11-08T12:03:35.000Z",
    "sourceUrl": "https://youtu.be/oQwumr6t0-c",
    "sourceId": "ypk4ft",
    "category": "question"
  },
  {
    "id": "099868df-91a8-453f-a855-a77b62746ca3",
    "title": "Milestones gone ?",
    "text": "Hey 👋 \n\nI've recently took the decision to migrate PM tools to Linear.  This decision was made for some time now, but since my other subscriptions are up only at the end of the year, I decided to postpone the migration.\n\nStarted said migration today and I'm a bit confused with the change of the Roadmaps feature.\n\nI'm a solo developer who is running multiple projects, one of them is a game and I thought I could group issues (features) into Milestones, like creating the basic systems first for the Pre-Production Milestone and a boss for the Demo Milestone. However, it seems that with the new roadmaps feature, this possibility is gone as I can only group projects instead of issues together.\n\nAny advice on how to accomplish what I intend ? I've thought about creating a different project, but feels wrong to decouple same project issues into two different projects just so I can play with Roadmaps...",
    "authorName": "DMorais92",
    "source": "reddit",
    "sourceCreatedAt": "2022-10-31T17:56:39.000Z",
    "sourceUrl": "https://www.reddit.com/r/Linear/comments/yijden/milestones_gone/",
    "sourceId": "yijden",
    "category": "question"
  },
  {
    "id": "1570ab3c-522c-4b10-a196-826f10777935",
    "title": "Full product management cycle",
    "text": "Hi everyone. I just discovered Linear recently through Twitter and it caught my attention.\n\nI was wondering if anyone here have some example of using Linear in similar way of Triple Track Agile, supporting a process that comprehend since the research (problem space) to delivery (solution space)\n\nThank you in advance.",
    "authorName": "1996zakin",
    "source": "reddit",
    "sourceCreatedAt": "2022-10-11T02:07:31.000Z",
    "sourceUrl": "https://www.reddit.com/r/Linear/comments/y0wsqh/full_product_management_cycle/",
    "sourceId": "y0wsqh",
    "category": "question"
  },
  {
    "id": "00a5c7ab-333e-47fc-96d0-86a7daf294df",
    "title": "How to use sub-issues in Linear",
    "text": "",
    "authorName": "gapmunky",
    "source": "reddit",
    "sourceCreatedAt": "2022-07-06T09:02:37.000Z",
    "sourceUrl": "https://youtu.be/0uZpdLHB7sY",
    "sourceId": "vslhve",
    "category": "question"
  },
  {
    "id": "af4a459b-95d0-467f-b572-7a6fd67cc7af",
    "title": "How to use Triage in Linear",
    "text": "",
    "authorName": "gapmunky",
    "source": "reddit",
    "sourceCreatedAt": "2022-04-05T12:13:26.000Z",
    "sourceUrl": "https://www.youtube.com/watch?v=p1ZtBCwey0I",
    "sourceId": "twtjiz",
    "category": "question"
  },
  {
    "id": "55701e82-b4c4-4525-a493-a33924d59582",
    "title": "How To Create Custom Views In Linear",
    "text": "",
    "authorName": "gapmunky",
    "source": "reddit",
    "sourceCreatedAt": "2022-03-03T15:01:08.000Z",
    "sourceUrl": "https://v.redd.it/x7efgctyn6l81",
    "sourceId": "t5th97",
    "category": "question"
  },
  {
    "id": "1554638e-1839-46b4-b206-8fbe54830976",
    "title": "Add multiple teams to your Linear projects in just a few clicks.",
    "text": "",
    "authorName": "gapmunky",
    "source": "reddit",
    "sourceCreatedAt": "2022-02-23T16:01:47.000Z",
    "sourceUrl": "https://i.redd.it/5lwgeu3kvlj81.png",
    "sourceId": "szkv4u",
    "category": "request",
    "insight": "Support for adding multiple teams to a single project",
    "priority": "normal"
  },
  {
    "id": "d39478b5-07bc-44c7-8501-3207404f3e7c",
    "title": "Analyzing Project Tickets in Linear to Improve Project Management &amp; Operations Efficiency",
    "text": "&amp;#x200B;\n\nhttps://preview.redd.it/qnlb74yql3i81.jpg?width=1408&amp;format=pjpg&amp;auto=webp&amp;s=dc4119ca2c4bac3430ccf18bbf12f992a57222a9\n\n**Intro -**  We have taken over 2000+ project tickets in Linear from different Relevance AI teams in 1 month, then applied clustering on them to find what task categories take longer to complete and which are completed in a fast turnaround time.\n\nhttps://preview.redd.it/rpqkruytl3i81.jpg?width=1444&amp;format=pjpg&amp;auto=webp&amp;s=de2ff5204eb2d9d20ac4c3c98a81ba9833ecdcc7\n\nProduct and project management revolves heavily around software in modern businesses such as Jira, Notion, Linear &amp; Monday, etc.\n\nFor some companies, 1k+ task tickets can be created in these project management platforms to manage these projects.\n\nThis is a wealth of unstructured data to draw insights from such as the agility, weakness and expertise of different company teams. All of this can surfaced by analyzing the unstructured text from these tickets.\n\nThis showcase is centered around demonstrating how we at Relevance AI actually utilized our own software to surface those insights for our team.\n\n**Dataset**\n\nCompiled from over 2000+ tickets taken from our project management system Linear. These were then exported into an CSV file and subsequently uploaded as a dataset in the Relevance AI platform, then vectorised &amp; clustered.\n\n&amp;#x200B;\n\n**Actionable Insights**\n\n&amp;#x200B;\n\n* The highest quantity of tickets were related to the development of our Clustering product.\n   * 76 tickets total with an average completion time of 11.7 hours per ticket.\n   *  Out of 76 tickets total, only 38 tickets were completed in that month. \n\n&amp;#x200B;\n\nhttps://preview.redd.it/2vqz9buyl3i81.jpg?width=1439&amp;format=pjpg&amp;auto=webp&amp;s=e1bdaa843a41fed6e0dbe222639a49256ba88414\n\n* Our fastest tickets were completed in 5.3 hours (note our team often works on tickets simultaneously). The majority of those tickets belonged to the Product team.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/lblywsn5m3i81.jpg?width=1448&amp;format=pjpg&amp;auto=webp&amp;s=d3637e4f6c3b19f7e945b783139d8117177fb648\n\n* Our slowest tickets were related to writing vector-based content, at an average of 13.4 hours.\n* Out of 22 tickets total, only 14 have been completed in that month. \n\n&amp;#x200B;\n\nhttps://preview.redd.it/x2jripl6m3i81.jpg?width=1441&amp;format=pjpg&amp;auto=webp&amp;s=633608578cb5f89928e32a8266a51c26484b1055\n\n* If we filter the data within our dashboard by the “Backend” team, the most completed tickets were related to “Chunk vector search”\n\nhttps://preview.redd.it/43y9zlz7m3i81.jpg?width=1429&amp;format=pjpg&amp;auto=webp&amp;s=89f91054e2368d9246d371c7f8722c914fb1b76a\n\n**Solution**\n\n* Two apps were created very quickly, thanks to our rapid experimentation features.\n   * An app that utilizes vector embeddings from OpenAI\n   * An app that utilizes vector embeddings from SentenceTransformers\n\n&amp;#x200B;\n\nIn order, the steps performed were:\n\n*  Ingesting the exported csv from our project management tool\n*  Vectorizing the ticket titles\n* Clustering on the vectors created from the ticket titles, ranging from 30-120 number of clusters\n* Validating those cluster quantitatively using our Cluster Report card which looks at range of statistical scores such as Silhouette score, Dunn index, etc.\n* Validating those clusters qualitatively by viewing the distance between words using both the cluster app and our 3d projector tool.  \n\n\nThanks for reading - If you're interested to run an analysis similar to the above on your own Linear tickets, feel free to sign up to Relevance AI today - [https://auth.relevance.ai/signup?utm\\_source=reddit&amp;utm\\_medium=social&amp;utm\\_campaign=linear](https://auth.relevance.ai/signup?utm_source=reddit&amp;utm_medium=social&amp;utm_campaign=linear)",
    "authorName": "wololowololowoloIo",
    "source": "reddit",
    "sourceCreatedAt": "2022-02-16T01:35:00.000Z",
    "sourceUrl": "https://www.reddit.com/r/Linear/comments/stjey5/analyzing_project_tickets_in_linear_to_improve/",
    "sourceId": "stjey5",
    "category": "request",
    "insight": "Potential case study/feature for demonstrating project management analytics and ticket analysis workflow",
    "priority": "low"
  },
  {
    "id": "322513d3-8110-4c82-b5c7-1bf39c62e076",
    "title": "Want to add a personal touch to your Workspace? Import emoji into Linear with the click of a button. ✨",
    "text": "",
    "authorName": "gapmunky",
    "source": "reddit",
    "sourceCreatedAt": "2022-02-10T12:40:08.000Z",
    "sourceUrl": "https://i.redd.it/e6a5zgvm30h81.png",
    "sourceId": "sp5p9z",
    "category": "request",
    "insight": "Add emoji customization feature for workspaces",
    "priority": "low"
  }
]
